import { CrownIcon } from "@/assets/icons/svg/crown";
import { Button } from "@/components/button/ui/Button";
import { Container } from "@/components/container/ui/Container";

export default function EditTextPage () {
	return (
		<Container className="flex flex-col">
			<h2 className="text-[24px] font-semibold pb-4 max-ssm:text-[14px] max-ssm:font-medium text-center shrink-0">
				Редактировать текст песни
      </h2>
			<div className="grow mt-2 overflow-y-auto min-h-0 font-medium leading-[24px]">
				<p>Чё ты гонишь, мусор, шнягу не по делу?</p>
				<p>Чё ты паришь мне про нары и конвой?</p>
				<p>Чё мазуришь ты на понт, я не товарка</p>
				<p>И пугаешь, падла, бабу Колымой?</p>
				<br />

				<p>От вашей грязи мусорской я настрадалась</p>
				<p>Поела вдоволь у хозяина харчей</p>
				<p>Я раньше срока, было дело, отзвонилась</p>
				<p>По актировке лазоретовских врачей</p>
				<br />

				<p>Хоп, мусорок, не шей мне срок</p>
				<p>Машина Зингера иголочку сломала</p>
				<p>Всех понятых, полублатных</p>
				<p>Да и тебя, бля, мусор, я в гробу видала</p>
				<br />

				<p>Я на себя брала всё дело под Самарой</p>
				<p>Не подтянула паровозом корешей</p>
				<p>В бараке лагерном фасон такой держала</p>
				<p>Не опустилась я до лагерных мышей</p>
				<br />

				<p>А ты звони мне по ушам, катай волыну</p>
				<p>Про тот лопатник из лоховской скулы</p>
				<p>Твой мусорок поднял пропуль, потом, как Тузик</p>
				<p>То нюхал руки мне, то грязные полы</p>
				<br />

				<p>Хоп, мусорок, не шей мне срок</p>
				<p>Машина Зингера иголочку сломала</p>
				<p>Всех понятых, полублатных</p>
				<p>Да и тебя, бля, мусор, я в гробу видала</p>
				<br />

				<p>Быки твои мне ласты лихо завернули</p>
				<p>Браслеты сжали белы рученьки мои</p>
				<p>На воронке вонючем подлецы катали</p>
				<p>И под конец в гадюшник этот привезли</p>
				<br />

				<p>Но фраернулись в этот раз менты что надо</p>
				<p>Я тот лопатник даже близко не брала</p>
				<p>И подписал ты зря, начальник, под терпилу</p>
				<p>Того, под шляпою, очкастого козла</p>

				<p>Но фраернулись в этот раз менты что надо</p>
				<p>Я тот лопатник даже близко не брала</p>
				<p>И подписал ты зря, начальник, под терпилу</p>
				<p>Того, под шляпою, очкастого козла</p>
				<br />

				<p>Но фраернулись в этот раз менты что надо</p>
				<p>Я тот лопатник даже близко не брала</p>
				<p>И подписал ты зря, начальник, под терпилу</p>
				<p>Того, под шляпою, очкастого козла</p>
			</div>
			<div className="shrink-0 flex items-center gap-4 mt-6 w-full justify-end">
				<Button
					variant="outline"
					className="py-4 text-[20px] w-[320px] flex items-center justify-center gap-2"
				>
					<CrownIcon />
					Редактировать текст
				</Button>
				<Button
					variant="solid"
					className="py-4 text-[20px] w-[320px]"
				>
					Продолжить
				</Button>
			</div>
		</Container>
	);
};