export const faq = [
  {
    id: 1,
    title: "Как мне создать песню?",
    content: "Для того, чтобы создать песню, вам нужно перейти в наш сервис...",
  },
  {
    id: 2,
    title: "Вы работаете только по России?",
    content: "Нет, мы работаем по всему миру.",
  },
  {
    id: 3,
    title: "А можно заказать песню под мой минус?",
    content: "Да, конечно!"
  },
  {
    id: 4,
    title: "Мне срочно нужна песня, насколько это быстро?",
    content: "10 минуит"
  },
  {
    id: 5,
    title: "У вас есть партнерская программа?",
    content: "Да, конечно!"
  },
];

export const examples = [
	{
		src: "/example-h.png",
		title: "Она скажет “Да!”",
		text: "Нежная поп-песня, которая дополнит предложение — ваша история любви. Лёгкий бит, синтезаторы и сияющий вокал создают настроение любви и вдохновения",
		audio: "/SoundHelix-Song-1.mp3",
	},
	{
		src: "/example-h.png",
		title: "С твоим днем",
		text: "Энергичная рок-песня на день рождения — с драйвом, юмором и любовью. Мощные гитары, плотный ритм и бодрый припев создают атмосферу праздника",
		audio: "/SoundHelix-Song-1.mp3",
	},
	{
		src: "/example-h.png",
		title: "Еще на год старше",
		text: "Весёлая и современная песня на день рождения ребенку — с энергией, юмором и теплом. Синт-бас, электронный бит и бодрый ритм передают дух праздника",
		audio: "/SoundHelix-Song-1.mp3",
	},
];

export const gifts = [
	{
		category: "Открытка",
		text: "Короткие, но трогательные поздравления. Можно добавить текст, фото  и выбрать стиль",
	},
	{
		category: "Песня на заказ",
		text: "Короткие, но трогательные поздравления. Можно добавить текст, фото  и выбрать стиль",
	},
	{
		category: "Слайд-шоу",
		text: "Короткие, но трогательные поздравления. Можно добавить текст, фото  и выбрать стиль",
	},
	{
		category: "Видео-поздравление",
		text: "Короткие, но трогательные поздравления. Можно добавить текст, фото  и выбрать стиль",
	},
];

export const steps = [
	{
		title: "Шаг 1",
		text: "Заполни короткую форму. Это станет брифом для будущего подарка",
	},
	{
		title: " Шаг 2",
		text: "Выбери формат своего подарка и загрузи изображения",
	},
	{
		title: "Шаг 3",
		text: "Получи готовый подарок — ссылку и MP4. Радуй близких!",
	}
];

export const features = ["качество", "скорость", "индивидуальность"];